import React from "react";
import n1 from "../assets/image/n1.jpeg";
import n2 from "../assets/image/n2.jpeg";

export default function NewsDetails() {
	return (
		<div className="mx-[10%] my-10">
			<h1 className="text-center text-3xl mb-2">News and Activities</h1>
			<div className="border-[2px] border-primary w-14 mx-auto rounded-full mb-4"></div>
			<div className="w-[100%] h-[100%] rounded-lg shadow-md pb-6">
				<img
					src="https://www.nbm.co.th/cms-pk//WareHouse/News/151223120240Cover.jpg"
					alt="card"
					className="rounded-t-md"
				/>
				<div className="p-4 flex items-center justify-center gap-2 px-10">
					<p className="text-md text-gray-800 flex-1">15 December 2023</p>
					<div className="flex items-center gap-2">
						<div className=" text-secondary text-4xl">|</div>
						NBM จัดกิจกรรม “Pink Line ส่งความสุข...ทุกโรงเรียน” พานักเรียน
						โรงเรียนเศรษฐบุตรบำเพ็ญ ทดลองใช้บริการรถไฟฟ้ามหานคร สายสีชมพู
					</div>
				</div>

				<div className="flex flex-col items-center justify-center gap-4 px-10">
					<p>
						&emsp; นางสาวนริศรา ศรีสันต์ ที่ปรึกษากลยุทธ์สื่อสารองค์กร บริษัท
						ระบบขนส่งมวลชนกรุงเทพ จำกัด (มหาชน) ในฐานะตัวแทนของ บริษัท
						นอร์ทเทิร์น บางกอกโมโนเรล จำกัด (NBM) และนายธวัชชัย พานิชยากรณ์
						ผู้อำนวยการฝ่ายปฏิบัติการ สายสีชมพู และ สายสีเหลือง นำทีมเจ้าหน้าที่
						และพนักงานร่วมกันจัดกิจกรรม“Pink Line ส่งความสุข...ทุกโรงเรียน”
						เพื่อให้ความรู้ในการใช้ระบบรถไฟฟ้ามหานคร สายสีชมพู
						อย่างถูกต้องและปลอดภัยให้กับน้อง ๆ นักเรียน โรงเรียนเศรษฐบุตรบำเพ็ญ
						โดยตั้งอยู่ใกล้บริเวณสถานีเศรษฐบุตรบำเพ็ญ (PK 28)โดยมี ดร.เตือนใจ
						ปิ่นนิกร ผู้อำนวยการ พร้อมคณะครูอาจารย์ และนักเรียนกว่า 600 คน
						ให้การต้อนรับและเข้าร่วมกิจกรรม
					</p>
					<img src={n1} alt="" className="w-[500px] h-[300px]" />
					<p>
						&emsp; โดยภายในงานได้จัดกิจกรรมให้ความรู้ เรื่องความปลอดภัย ระเบียบ
						ข้อปฏิบัติ การใช้ระบบรถไฟฟ้าอย่างถูกต้อง
						ผ่านวิดีโอส่งเสริมทักษะความรู้ รวมถึงการมีกิจกรรมสันทนาการ
						พร้อมจัดกิจกรรมตอบคำถามและแจกของรางวัลจากรถไฟฟ้ามหานคร สายสีชมพู
						รวมถึงได้เชิญวิทยากรพิเศษ นำโดย คุณกาญจน์ ล้วนปรีดา กรรมาธิการ
						ด้านพัฒนากีฬาสหพันธ์สเก็ตน้ำแข็งนานาชาติ
						พร้อมตัวแทนนักกีฬาจากสมาคมกีฬาฟิกเกอร์และสปีดสเก็ตติ้ง
						แห่งประเทศไทยมาร่วมบรรยายประสบการณ์ พร้อมสอนเทคนิคขั้นพื้นฐาน รวมถึง
						กฎ กติกาเพื่อเสริมทักษะด้านกีฬา นอกจากนี้ ได้พาน้อง ๆ
						นักเรียนมาทดลองใช้บริการรถไฟฟ้ามหานครสายสีชมพู
						จากสถานีเศรษฐบุตรบำเพ็ญ (PK 28) ถึงสถานีวัดพระศรีมหาธาตุ (PK 16)
						รวมทั้งสิ้น 12 สถานี เพื่อเสริมสร้างประสบการณ์นอกห้องเรียน อีกด้วย
					</p>
					<img src={n2} alt="" className="w-[500px] h-[300px]" />
					<p>
						&emsp; สามารถสอบถามรายละเอียดเพิ่มเติมได้ที่
						ศูนย์ลูกค้าสัมพันธ์รถไฟฟ้ามหานคร สายสีชมพู MRT Pink Line Call Center
						โทรศัพท์ 0 2 - 617- 6111 Line Official : @pinkyellowline เว็บไซต์
						www.nbm.co.th หรือ Facebook Page : MRTPinkLine
					</p>
				</div>
			</div>
		</div>
	);
}
